// ojetto 31 | mock 41

// crp - crytical render path, 
// единственное когда не происходит reflow это transfrom css

// чем семантика отличается от доступности
// параметрический/ad hoc полиморфизм
// что может оставаться от ts после компиляции? енамы
// system design - проектирование системы
// физические способы хранения данных, жесткие диски, ssd, перфоркарты бабины. Оператива
// в банке все сервисы общаются только http запросами? проблемы
// инструменты горизонтальной репликации
// инструменты увеливичающие скорость отдачи. Redis, ngnix, самим next-ом?

// review
// обработка ошибки, мэпинг ролей, разделение логики а для случая graphql
// magic string -> enum ролей
// саша беспоясов solid book